app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.create(restaurant_params)
---
INSERT INTO "restaurants" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Restaurantie"], ["description", "Nice place."], ["created_at", 2016-11-17 14:32:17 UTC], ["updated_at", 2016-11-17 14:32:17 UTC], ["user_id", 2]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "restaurants" SET "description" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["description", "Fancy seafood restaurant serving small plates of yumminess."], ["updated_at", 2016-11-17 15:47:03 UTC], ["id", 6]]

  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 1]]