app/controllers/reviews_controller.rb

  def create
    # the review needs a user id - just need to do the reading to figure out how
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.reviews.create(review_params)
    if @review.save
			redirect_to restaurant_path(params[:restaurant_id])
		else
      @review.errors.each {|e| puts e}
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("comments", "rating", "restaurant_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comments", "Testy"], ["rating", 4], ["restaurant_id", 4], ["created_at", 2016-11-17 17:24:56 UTC], ["updated_at", 2016-11-17 17:24:56 UTC], ["user_id", 2]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 6]]